/************** расчёт расхода нефти *****************************/
/*начат 26-06-09 */

#include<math.h>

#define Max_conf         4   /*число конфиг.параметров задачи*/
#define Max_select       9
#define Max_dyn          9
#define Max_dyn_massive 19
#define Max_main        66   /*число конфиг.параметров станции*/
#define Max_select_main 50
#define Max_archive      4   /*число архив.параметров задачи*/
#define Max_arch_pnt    40   /*число архив.точек станции*/
#define Max_arch_record 167  /*макс длина архив записи в байтах*/
#define Max_dyn_all      59
#define Max_save        248
#define Max_icp_prm      72  /*число параметров настроек модулей*/
#define Max_exp_prm      60
#define Max_exp_dyn      40
#define Max_exp_const    20

struct modbus_config       Modbus;
const unsigned char size_conf[8]={17,17,17,17,240,0,216,233};
const unsigned char etl[8] = {1,2,4,8,16,32,64,128};
const unsigned char ind_prm_alm[4]={81,82,84,85};
const unsigned char typ_port[4] = {3,5,4,1};
unsigned char ind_accum[4]={1,2,4,6};
/*гигадж или гигакал, гигадж в час или гигакал в час,
  килодж на кг или килокал на кг*/
const unsigned char sel_units[3][2]={{6,7},{15,16},{12,19}};
unsigned char exp_dyn[Max_exp_dyn][5];
float exp_const[Max_exp_const];
float density_rem[30]; unsigned char count_rem,flg_compens;
const unsigned char conf_menu[8][6]={
 {1,1,2,3,4,5},/*общие установки*/{1,6,0,8,0,0},/*первая точка*/
 {1,6,0,8,0,0},/*вторая точка*/   {0,0,0,0,0,0},/*третья точка*/
 {0,0,0,0,0,0},/*четвёртая точка*/{0,0,0,0,0,0},/*доп точка*/
 {1,11,0,0,0,0},/*модули в/в*/    {0,0,0,0,0,0}/*резерв*/};
/*[0]-начальный адрес,
/*[1]-размер смещения,
  [2]-признак сохранения в ЭНП:>1- да,2-накопление,3-усреднение*/
const unsigned char main_dyn[Max_dyn][3]={
 {0,1,0}/*Регистр ошибок*/,{1,1,0}/*Расход масс*/,{2,4,3}/*Плотность*/,
 {6,4,3}/*Температура*/,{10,1,0}/*Расход объм*/, {11,8,2}/*Счётчики массы*/,
 {19,8,2}/*Счётчики объёма*/,{27,1,0}/*Тотал массы от массомера*/,
 {28,1,0}/*Тотал обм от масс*/};
/*тип накоп: 1-часовой счётчик,2-суточный,3-прош сутки,
	     4-месячный, 5-пр месяц, 6-тотал */
/*тип усредн: 1-час усреднен,2-сутки, 3-месяц*/
/*расшир.дин.параметры[0]-начальный адрес,[1]-индекс смещения,[2]-индекс имени
[3]-индекс единиц,[4]-признак накопленных,[5]-признак поверки:1-выходные,>1-исходные
[6]-модбас:64-в качестве ответчика,128-в качестве задатчика,192-оба+ном фун
  [7]-скрипты,[8]-признак очистки параметра*/
const unsigned char dyn_set[Max_dyn_massive][9]={
{1,0,5,5,0,0,194,1,0}/*Мгн расход массы от мм*/,
{10,0,6,4,0,0,194,1,0}/*Мгн расход обм от мм*/,
{2,0,4,8,0,0,194,1,0}/*Плотность от мм*/,
{6,0,3,3,0,0,194,1,0}/*Температ от мм*/,
{27,0,67,13,0,0,194,1,0}/*Масса тотал от мм*/,
{28,0,68,14,0,0,194,1,0}/*Объём тотал от мм*/,

{11,1,5,13,2,0,194,1,1}/*Масса за час*/,
{11,2,5,13,2,0,194,1,1}/*Масса за сутки*/,
{11,3,5,13,2,0,194,1,1}/*Масса за пр сутки*/,
{11,4,5,13,2,0,194,1,1}/*Масса за месяц*/,
{11,5,5,13,2,0,194,1,1}/*Масса за пр мес*/,
{11,6,5,13,2,0,194,1,1}/*Масса за год*/,

{19,1,6,14,2,0,194,1,1}/*Объём за час*/,
{19,2,6,14,2,0,194,1,1}/*Объём за сутки*/,
{19,3,6,14,2,0,194,1,1}/*Объём за пр сутки*/,
{19,4,6,14,2,0,194,1,1}/*Объём за месяц*/,
{19,5,6,14,2,0,194,1,1}/*Объём за пр месяц*/,
{19,6,6,14,2,0,194,1,1}/*Объём за год*/,
{0,0,56,0,0,0,194,1,0}/*Статус масомер*/,};
/*[0]-индекс имени,[1]-длина параметра,[2]-адрес начальный
тип данных:строка-0,байт-1,одиночный выбор-2,множ.выбор-3,дейст.число-4
[3]-тип данных,[4]-номер для однотипных,иначе-128 [5]-индекс единиц,
  [6]-пароль для изменения нужен:1,2-изменение через MMI невозможно*/
unsigned char conf_main[Max_main][7]={
 {36/*Адрес станции(0)*/,1,1,1,128,0,1},{37/*Контракт час(1)*/,1,2,1,128,0,1},
 {38/*Терминал опер(2)*/,1,3,2,128,0,1},{87/*Адрес Мас #1(3)*/,1,4,1,128,0,1},
 {98/*Адрес Мас #2(4)*/,1,5,1,128,0,1},
 {45/*Адрес ICP #1(5)*/,1,6,1,128,0,1},
 {46/*Адрес ICP #2(6)*/,1,7,1,128,0,1},{47/*Адрес ICP #3(7)*/,1,8,1,128,0,1},
 {48/*Адрес ICP #4(8)*/,1,9,1,128,0,1},{43/*Летнее/зимнее(9)*/,1,10,3,128,0,2},
 {52/*Тип ICP #1(10)*/,1,11,2,128,0,1},
 {53/*Тип ICP #2(11)*/,1,12,2,128,0,1},{54/*Тип ICP #3(12)*/,1,13,2,128,0,1},
 {55/*Тип ICP #4(13)*/,1,14,2,128,0,1},{58/*Модбас(14)*/,1,15,7,128,0,2},
 {49/*Пароль(15)*/,4,16,5,128,0,2},{59/*Порт_1 (16)*/,2,20,6,0,0,2},
 {59/*Порт_2(17)*/,2,22,6,1,0,2},{59/*Порт_3 (18)*/,2,24,6,2,0,2},
 {59/*Порт_4(19)*/,2,26,6,3,0,2},{60/*Арх_1 (20)*/,4,28,8,0,0,2},
 {60/*Арх_2(21)*/,4,32,8,1,0,2},{60 /*Арх_3 (22)*/,4,36,8,2,0,2},
 {60/*Арх_4(23)*/,4,40,8,3,0,2},{60 /*Арх_5 (24)*/,4,44,8,4,0,2},
 {60/*Арх_6(25)*/,4,48,8,5,0,2},{60 /*Арх_7 (26)*/,4,52,8,6,0,2},
 {60/*Арх_8 (27)*/,4,56,8,7,0,2},{60 /*Арх_9 (28)*/,4,60,8,8,0,2},
 {60/*Арх_10 (29)*/,4,64,8,9,0,2},{60 /*Арх_11 (30)*/,4,68,8,10,0,2},
 {60/*Арх_12 (31)*/,4,72,8,11,0,2},{60 /*Арх_13 (32)*/,4,76,8,12,0,2},
 {60/*Арх_14 (33)*/,4,80,8,13,0,2},{60 /*Арх_15 (34)*/,4,84,8,14,0,2},
 {60/*Арх_16 (35)*/,4,88,8,15,0,2},{60 /*Арх_17 (36)*/,4,92,8,16,0,2},
 {60/*Арх_18 (37)*/,4,96,8,17,0,2},{60 /*Арх_19 (38)*/,4,100,8,18,0,2},
 {60/*Арх_20 (39)*/,4,104,8,19,0,2},{60 /*Арх_21 (40)*/,4,108,8,20,0,2},
 {60/*Арх_22 (41)*/,4,112,8,21,0,2},{60 /*Арх_23 (42)*/,4,116,8,22,0,2},
 {60/*Арх_24 (43)*/,4,120,8,23,0,2},{60 /*Арх_25 (44)*/,4,124,8,24,0,2},
 {60/*Арх_26 (45)*/,4,128,8,25,0,2},{60 /*Арх_27 (46)*/,4,132,8,26,0,2},
 {60/*Арх_28 (47)*/,4,136,8,27,0,2},{60 /*Арх_29 (48)*/,4,140,8,28,0,2},
 {60/*Арх_30 (49)*/,4,144,8,29,0,2},{60 /*Арх_31 (50)*/,4,148,8,30,0,2},
 {60/*Арх_32 (51)*/,4,152,8,31,0,2},{60 /*Арх_33 (52)*/,4,156,8,32,0,2},
 {60/*Арх_34 (53)*/,4,160,8,33,0,2},{60 /*Арх_35 (54)*/,4,164,8,34,0,2},
 {60/*Арх_36 (55)*/,4,168,8,35,0,2},{60 /*Арх_37 (56)*/,4,172,8,36,0,2},
 {60/*Арх_38 (57)*/,4,176,8,37,0,2},{60 /*Арх_39 (58)*/,4,180,8,38,0,2},
 {60/*Арх_40 (59)*/,4,184,8,39,0,2},{35 /*Тег (60)*/,10,188,10,128,0,2},
 {50/*Телеф.номер(61)*/,20,198,0,128,0,2},{51/*Модем(62)*/,10,218,10,128,0,2},
 {44/*Пароль операт(63)*/,2,228,9,128,0,1},
 {72/*Способ настр.порта(64)*/,1,230,2,128,0,2},
 {74/*Обработка скрипта(65)*/,1,231,2,128,0,1},

};
unsigned char main_select[Max_select_main]={
  9,2,3,0,51,52,  9,2,53,54,  10,6,55,56,57,58,35,36,
  11,6,55,56,57,58,35,36, 12,6,55,56,57,58,35,36, 13,6,55,56,57,58,35,36,
  64,2,87,88, 65,2,0,1};
/*[0]-индекс имени,[1]-длина параметра,[2]-адрес начальный
тип данных:строка-0,байт-1,одиночный выбор-2,множ.выбор-3,дейст.число-4
[3]-тип данных,[4]-номер для однотипных,иначе-128 [5]-индекс единиц,
  [6]-пароль для изменения нужен:1,2-изменение через MMI невозможно*/
unsigned char conf_basic[Max_conf][7]={
 {1/*Статус точки(0)*/,1,0,2,128,0,1},
 {13/*Отсечка мин(1)*/,4,2,4,128,4,1},
 {35/*Тег идент(2)*/,10,6,0,128,0,2},
 {97/*Полярность выходов(3)*/,1,16,2,128,0,1},
};
unsigned char conf_select[Max_select]={
  2,0,2,0,1, 3,2,112,113};
/*[0]-единицы измерения
  [1]-нач адрес параметра в списке точки
  [2]-тип архивирования
  [3]-имя параметра*/
/*плотность,температура,брутто,нетто,влажность*/
const unsigned char set_archive[Max_archive][4]={
  {8,2,3,4}, /*плотность*/
  {3,6,3,3}, /*температура*/
  {26,11,2,5}, /*счётчики массы*/
  {27,19,2,6}, /*счётчики объёма*/
   };
unsigned char conf_icp[Max_icp_prm][7]={
  {65,1,0,12,0,0,2},{65,1,1,12,1,0,2},{65,1,2,12,2,0,2},{65,1,3,12,3,0,2},
  {65,1,4,12,4,0,2},{65,1,5,12,5,0,2},{65,1,6,12,6,0,2},{65,1,7,12,7,0,2},
  {65,1,8,12,8,0,2},{65,1,9,12,9,0,2},{65,1,10,12,10,0,2},
  {65,1,11,12,11,0,2},{65,1,12,12,12,0,2},{65,1,13,12,13,0,2},
  {65,1,14,12,14,0,2},{65,1,15,12,15,0,2},{66,4,16,4,0,0,1},
  {66,4,20,4,1,0,1},{66,4,24,4,2,0,1},{66,4,28,4,3,0,1},{66,4,32,4,4,0,1},
  {66,4,36,4,5,0,1},{66,4,40,4,6,0,1},{66,4,44,4,7,0,1},{66,4,48,4,8,0,1},
  {66,4,52,4,9,0,1},{66,4,56,4,10,0,1},{66,4,60,4,11,0,1},{66,4,64,4,12,0,1},
  {66,4,68,4,13,0,1},{66,4,72,4,14,0,1},{66,4,76,4,15,0,1},{67,4,80,4,0,0,1},
  {67,4,84,4,1,0,1},{67,4,88,4,2,0,1},{67,4,92,4,3,0,1},{67,4,96,4,4,0,1},
  {67,4,100,4,5,0,1},{67,4,104,4,6,0,1},{67,4,108,4,7,0,1},{67,4,112,4,8,0,1},
  {67,4,116,4,9,0,1},{67,4,120,4,10,0,1},{67,4,124,4,11,0,1},
  {67,4,128,4,12,0,1},{67,4,132,4,13,0,1},{67,4,136,4,14,0,1},{67,4,140,4,15,0,1},
  {77,1,144,12,0,0,2},{77,1,145,12,1,0,2},{77,1,146,12,2,0,2},{77,1,147,12,3,0,2},
  {77,1,148,12,4,0,2},{77,1,149,12,5,0,2},{77,1,150,12,6,0,2},{77,1,151,12,7,0,2},
  {78,4,152,4,0,0,1},{78,4,156,4,1,0,1},{78,4,160,4,2,0,1},{78,4,164,4,3,0,1},
  {78,4,168,4,4,0,1},{78,4,172,4,5,0,1},{78,4,176,4,6,0,1},{78,4,180,4,7,0,1},
  {79,4,184,4,0,0,1},{79,4,188,4,1,0,1},{79,4,192,4,2,0,1},{79,4,196,4,3,0,1},
  {79,4,200,4,4,0,1},{79,4,204,4,5,0,1},{79,4,208,4,6,0,1},{79,4,212,4,7,0,1},
};
unsigned char conf_exp[Max_exp_prm][5]={
 {68,4,0,14,0},{68,4,4,14,1},{68,4,8,14,2},{68,4,12,14,3},
 {68,4,16,14,4},{68,4,20,14,5},{68,4,24,14,6},{68,4,28,14,7},
 {68,4,32,14,8},{68,4,36,14,9},{68,4,40,14,10},{68,4,44,14,11},
 {68,4,48,14,12},{68,4,52,14,13},{68,4,56,14,14},{68,4,60,14,15},
 {68,4,64,14,16},{68,4,68,14,17},{68,4,72,14,18},{68,4,76,14,19},
 {68,4,80,14,20},{68,4,84,14,21},{68,4,88,14,22},{68,4,92,14,23},
 {68,4,96,14,24},{68,4,100,14,25},{68,4,104,14,26},{68,4,108,14,27},
 {68,4,112,14,28},{68,4,116,14,29},{68,4,120,14,30},{68,4,124,14,31},
 {68,4,128,14,32},{68,4,132,14,33},{68,4,136,14,34},{68,4,140,14,35},
 {68,4,144,14,36},{68,4,148,14,37},{68,4,152,14,38},{68,4,156,14,39},
 {73,4,160,4,0},{73,4,164,4,1},{73,4,168,4,2},{73,4,172,4,3},{73,4,176,4,4},
 {73,4,180,4,5},{73,4,184,4,6},{73,4,188,4,7},{73,4,192,4,8},{73,4,196,4,9},
 {73,4,200,4,10},{73,4,204,4,11},{73,4,208,4,12},{73,4,212,4,13},
 {73,4,216,4,14},{73,4,220,4,15},{73,4,224,4,16},{73,4,228,4,17},
 {73,4,232,4,18},{73,4,236,4,19}};
struct dynparams
{
  double dyn[Max_dyn_all];
  unsigned long   cnt[4];
};
struct station
{
  unsigned char task;        /*тип решаемой задачи*/
  unsigned char addr;        /*адрес контроллера*/
  unsigned char contrh;       /*контрактный час*/
  unsigned char mmi;         /*применение терминала оператора*/
  unsigned char adr_meter[2];   /*адрес массомеров*/
  unsigned char adr_icp[4];  /*адреса модулей*/
  unsigned char autogo;      /*автопереход на летнее/зимнее время*/
  unsigned char typ_icp[4];              /*тип модуля*/
  unsigned char modbus;
  unsigned char passw[4];               /*пароль на изменение конфигурации*/
  unsigned char com[4][2];               /*настройки портов*/
  unsigned char arch[Max_arch_pnt][4];   /*настройки архивных точек*/
  unsigned char tag[10];
  unsigned char phone[20];
  unsigned char at[10];
  unsigned char set_com;                 /*разрешение на СОМ4*/
  unsigned      passw_op;                /*пароль оператора*/
  unsigned char script;
  unsigned char units;
  unsigned char panel;
};
struct configparam
{
  unsigned char status;          /*точка включена или выключена*/
  float         cut_flow;       /*отсечка миним расхода*/
  unsigned char tag[10];
  unsigned char polar;          /*полярность импульсных выходов*/
};
struct modbus_config
{
  unsigned char mode;             /*комментарии в heat.c*/
  unsigned char protocol;
  unsigned char connect;
  unsigned char delay;
};
struct pulse_output
{
  unsigned char flag;
  unsigned char cnt;
  unsigned char on;
  float value;
  float value_old;
};
/******* инициализация параметров структуры: станция ***********/
void InitStationStruct (struct station *dv)
{
  unsigned char i;
  dv->task=ReadEEP(7,0);dv->addr=ReadEEP(7,1);
  dv->contrh=ReadEEP(7,2);dv->mmi=ReadEEP(7,3);
  dv->adr_meter[0]=ReadEEP(7,4); dv->adr_meter[1]=ReadEEP(7,5);
  dv->autogo=ReadEEP(7,10);
  for (i=0;i<4;i++) dv->adr_icp[i]=ReadEEP(7,6+i);
  for (i=0;i<4;i++) dv->typ_icp[i]=ReadEEP(7,11+i);
  for (i=0;i<4;i++) dv->passw[i]=ReadEEP(7,16+i);
  dv->modbus=ReadEEP(7,15);
  for (i=0;i<4;i++)
  {dv->com[i][0]=ReadEEP(7,20+i*2);dv->com[i][1]=ReadEEP(7,21+i*2);}
  for (i=0;i<10;i++) dv->tag[i]=ReadEEP(7,188+i);
  for (i=0;i<20;i++) dv->phone[i]=ReadEEP(7,198+i);
  for (i=0;i<10;i++) dv->at[i]=ReadEEP(7,218+i);
  Modbus.mode=(dv->modbus & 16) >> 4;Modbus.delay=dv->modbus & 7;
  Modbus.protocol=(dv->modbus & 8) >> 3;
  Modbus.connect=(dv->modbus & 96) >> 5;dv->set_com=ReadEEP(7,230);
  dv->passw_op=ReadEEP(7,228)*256+ReadEEP(7,229);
  dv->script=ReadEEP(7,231);
}
/******* инициализация структуры:конфигурация учёта газа**********/
void InitBasicStruct (unsigned char num,struct configparam *cnf)
{
  unsigned char i,j,k,cr[4];float buf[10];
  cnf->status=ReadEEP(num,0);
  if (SecurityConvert(ReadEEP(num,2+j),ReadEEP(num,3+j),
       ReadEEP(num,4+j),ReadEEP(num,5+j),cr)==0)
  cnf->cut_flow=ConvToFloat(cr[0],cr[1],cr[2],cr[3]);
  for (i=0;i<10;i++) cnf->tag[i]=ReadEEP(num,6+i);
  cnf->polar=ReadEEP(num,16);
}
/******* инициализация параметров архива *************/
unsigned char InitArchive (struct station *dv)
{
  unsigned char i,k;k=0;
  for (i=0;i<Max_arch_pnt;i++)
  {
    dv->arch[i][0]=ReadEEP(7,28+i*4);dv->arch[i][1]=ReadEEP(7,29+i*4);
    dv->arch[i][2]=ReadEEP(7,30+i*4);dv->arch[i][3]=ReadEEP(7,31+i*4);
    if (dv->arch[i][0] != 0) k++;
  } return 7+k*4;
}
/******** установка или очистка алармов параметра****************/
unsigned char SetClearAlarmsPrm (float borders[],unsigned char status,
				 float value,unsigned char num_pnt,
				 unsigned char num_prm)
{ /*статус: 0-нет алармов, 1-нижний, 2-верхний*/
  /*начальный адрес статусов алармов в ЭНП : 0С320 */
  const unsigned char num_alm[4][2]={{0,1},{2,3},{4,5},{6,7}};
  unsigned char flag,cr[4],j,buf_alm[16];
  if (borders[2]<=0.0 || (borders[1]-borders[0])<=0.0) {flag=2;goto M;}
  FormateEvent(buf_alm);buf_alm[13]=num_pnt;flag=0;
  if (status == 0  && value > borders[1])
  {status=2;flag=1;buf_alm[10]=1;buf_alm[14]=num_alm[num_prm][1];} else
  if (status == 2 && value<=(borders[1]-borders[2]))
  {status=0;flag=1;buf_alm[10]=0;buf_alm[14]=num_alm[num_prm][1];} else
  if (status == 0 && value < borders[0])
  {status=1;flag=1;buf_alm[10]=1;buf_alm[14]=num_alm[num_prm][0];} else
  if (status == 1 && value>= (borders[0]+borders[2]))
  {status=0;flag=1;buf_alm[10]=0;buf_alm[14]=num_alm[num_prm][0];}
  if (flag == 1)
  {
    ConvToBynare(value,cr);
    for (j=0;j<4;j++) buf_alm[6+j]=cr[j];WriteEvent(buf_alm,1);
    X607_Write(390,32+num_pnt*4+num_prm,status);
  }
  M:return status;
}

/******** формирование архивной записи по типу архива и точкам ***/
unsigned char FormateArchive (struct station dv,struct dynparams bs[],
			  unsigned char typ_arc,unsigned char buf[])
{
  unsigned char i,j,ind_pnt,cr[4];float value;ind_pnt=0;
 /* printf(" begin "); */
  for (i=0;i<Max_arch_pnt;i++)
  if (dv.arch[i][0] !=0 && dv.arch[i][1]<4 && dv.arch[i][3]<7)
  {
    /*printf(" point %d %d %d %d",dv.arch[i][0],dv.arch[i][1],dv.arch[i][2],dv.arch[i][3]);*/
    value=0.0;
    switch (dv.arch[i][0])
    { case 1:if (dv.arch[i][2]<Max_dyn_all)
	     switch (dv.arch[i][3])
	     {
	       case 1:value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]];break;
	       case 2:
	       switch (typ_arc)
	       {
		 case 0:value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]+2];break;
		 case 1:value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]+1];break;
		 case 2:value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]+7];break;
	       } break;
	       case 3:
	       switch (typ_arc)
	       {
		 case 0:value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]+2];break;
		 case 1:value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]+1];break;
	       } break;
	       case 4: case 6:
		 value=bs[dv.arch[i][1]].dyn[dv.arch[i][2]+dv.arch[i][3]];break;
	     } break;
    } ConvToBynare(value,cr);
      for (j=0;j<4;j++) buf[7+ind_pnt*4+j]=cr[j];ind_pnt++;
  } return ind_pnt;
}
/******************************************************************/